{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FMarkdownAssetEditorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Batch Convert to Markdown..."
					},
					"Translation":
					{
						"Text": "Markdownへ一括変換..."
					},
					"Key": "MarkitdownBatchConvertLabel"
				},
				{
					"Source":
					{
						"Text": "Markdown"
					},
					"Translation":
					{
						"Text": "Markdown"
					},
					"Key": "MarkdownAssetCategory"
				},
				{
					"Source":
					{
						"Text": "Markdown"
					},
					"Translation":
					{
						"Text": "Markdown"
					},
					"Key": "MarkdownToolsSection"
				},
				{
					"Source":
					{
						"Text": "Pick PDF/DOCX/PPTX/HTML files and create UMarkdownAsset entries via markitdown."
					},
					"Translation":
					{
						"Text": "PDF/DOCX/PPTX/HTML ファイルを選択し、markitdown 経由で UMarkdownAsset を作成します。"
					},
					"Key": "MarkitdownBatchConvertTooltip"
				}
			]
		},
		{
			"Namespace": "FMarkitdownConverter",
			"Children": [
				{
					"Source":
					{
						"Text": "Could not locate 'uvx' on PATH. Install uv (https://github.com/astral-sh/uv) or change Execution Mode in Project Settings > Plugins > Markitdown."
					},
					"Translation":
					{
						"Text": "PATH 上に 'uvx' が見つかりませんでした。uv (https://github.com/astral-sh/uv) をインストールするか、Project Settings > Plugins > Markitdown で Execution Mode を変更してください。"
					},
					"Key": "MarkitdownMissingUvx"
				},
				{
					"Source":
					{
						"Text": "Could not locate the Python executable. Set Python Executable Path in Project Settings > Plugins > Markitdown."
					},
					"Translation":
					{
						"Text": "Python 実行ファイルが見つかりませんでした。Project Settings > Plugins > Markitdown で Python Executable Path を設定してください。"
					},
					"Key": "MarkitdownMissingPython"
				},
				{
					"Source":
					{
						"Text": "Custom command is empty or invalid. Configure it in Project Settings > Plugins > Markitdown."
					},
					"Translation":
					{
						"Text": "Custom Command が未設定または無効です。Project Settings > Plugins > Markitdown で設定してください。"
					},
					"Key": "MarkitdownMissingCustom"
				},
				{
					"Source":
					{
						"Text": "Failed to launch markitdown process."
					},
					"Translation":
					{
						"Text": "markitdown プロセスの起動に失敗しました。"
					},
					"Key": "MarkitdownExecFailed"
				},
				{
					"Source":
					{
						"Text": "Input file does not exist: {0}"
					},
					"Translation":
					{
						"Text": "入力ファイルが存在しません: {0}"
					},
					"Key": "MarkitdownInputMissing"
				},
				{
					"Source":
					{
						"Text": "Markitdown"
					},
					"Translation":
					{
						"Text": "Markitdown"
					},
					"Key": "MarkitdownDialogTitle"
				},
				{
					"Source":
					{
						"Text": "Markitdown executable could not be resolved."
					},
					"Translation":
					{
						"Text": "markitdown の実行ファイルを解決できませんでした。"
					},
					"Key": "MarkitdownMissingUnknown"
				},
				{
					"Source":
					{
						"Text": "Markitdown settings are not available."
					},
					"Translation":
					{
						"Text": "Markitdown の設定を取得できません。"
					},
					"Key": "MarkitdownNoSettings"
				},
				{
					"Source":
					{
						"Text": "markitdown completed but its output file could not be read."
					},
					"Translation":
					{
						"Text": "markitdown は完了しましたが、出力ファイルを読み取れませんでした。"
					},
					"Key": "MarkitdownNoOutput"
				},
				{
					"Source":
					{
						"Text": "markitdown exited with code {0}."
					},
					"Translation":
					{
						"Text": "markitdown が終了コード {0} で終了しました。"
					},
					"Key": "MarkitdownNonZero"
				}
			]
		},
		{
			"Namespace": "MarkdownAssetActions",
			"Children": [
				{
					"Source":
					{
						"Text": "Markdown Text"
					},
					"Translation":
					{
						"Text": "Markdownテキスト"
					},
					"Key": "MarkdownAssetName"
				}
			]
		},
		{
			"Namespace": "MarkdownAssetEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "(untitled)"
					},
					"Translation":
					{
						"Text": "(無題)"
					},
					"Key": "OutlineUntitledHeading"
				},
				{
					"Source":
					{
						"Text": "1."
					},
					"Translation":
					{
						"Text": "1."
					},
					"Key": "NumberedList"
				},
				{
					"Source":
					{
						"Text": "B"
					},
					"Translation":
					{
						"Text": "B"
					},
					"Key": "Bold"
				},
				{
					"Source":
					{
						"Text": "Code"
					},
					"Translation":
					{
						"Text": "コード"
					},
					"Key": "Code"
				},
				{
					"Source":
					{
						"Text": "Edit Markdown Text"
					},
					"Translation":
					{
						"Text": "Markdownテキストを編集"
					},
					"Key": "EditMarkdownText"
				},
				{
					"Source":
					{
						"Text": "H1"
					},
					"Translation":
					{
						"Text": "H1"
					},
					"Key": "H1"
				},
				{
					"Source":
					{
						"Text": "H2"
					},
					"Translation":
					{
						"Text": "H2"
					},
					"Key": "H2"
				},
				{
					"Source":
					{
						"Text": "H3"
					},
					"Translation":
					{
						"Text": "H3"
					},
					"Key": "H3"
				},
				{
					"Source":
					{
						"Text": "HR"
					},
					"Translation":
					{
						"Text": "HR"
					},
					"Key": "HR"
				},
				{
					"Source":
					{
						"Text": "H{0} - Line {1}"
					},
					"Translation":
					{
						"Text": "H{0} - {1}行目"
					},
					"Key": "OutlineItemTooltip"
				},
				{
					"Source":
					{
						"Text": "I"
					},
					"Translation":
					{
						"Text": "I"
					},
					"Key": "Italic"
				},
				{
					"Source":
					{
						"Text": "List"
					},
					"Translation":
					{
						"Text": "リスト"
					},
					"Key": "BulletList"
				},
				{
					"Source":
					{
						"Text": "Markdown Asset Editor"
					},
					"Translation":
					{
						"Text": "Markdownアセットエディタ"
					},
					"Key": "ToolkitName"
				},
				{
					"Source":
					{
						"Text": "Markdown Editor"
					},
					"Translation":
					{
						"Text": "Markdownエディタ"
					},
					"Key": "MainTab"
				},
				{
					"Source":
					{
						"Text": "Markdown Editor"
					},
					"Translation":
					{
						"Text": "Markdownエディタ"
					},
					"Key": "MarkdownEditorCommands"
				},
				{
					"Source":
					{
						"Text": "Markdown Editor"
					},
					"Translation":
					{
						"Text": "Markdownエディタ"
					},
					"Key": "EditorTabLabel"
				},
				{
					"Source":
					{
						"Text": "Open External URL"
					},
					"Translation":
					{
						"Text": "\t外部URLを開く"
					},
					"Key": "ConfirmExternalUrlTitle"
				},
				{
					"Source":
					{
						"Text": "Open this URL in your default browser?\n\n{0}"
					},
					"Translation":
					{
						"Text": "このURLを既定のブラウザで開きますか？"
					},
					"Key": "ConfirmExternalUrlMessage"
				},
				{
					"Source":
					{
						"Text": "Outline"
					},
					"Translation":
					{
						"Text": "アウトライン"
					},
					"Key": "OutlineTab"
				},
				{
					"Source":
					{
						"Text": "Outline"
					},
					"Translation":
					{
						"Text": "アウトライン"
					},
					"Key": "OutlineTabLabel"
				},
				{
					"Source":
					{
						"Text": "Quote"
					},
					"Translation":
					{
						"Text": "引用"
					},
					"Key": "Quote"
				},
				{
					"Source":
					{
						"Text": "S"
					},
					"Translation":
					{
						"Text": "S"
					},
					"Key": "Strikethrough"
				},
				{
					"Source":
					{
						"Text": "Table"
					},
					"Translation":
					{
						"Text": "テーブル"
					},
					"Key": "Table"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "MarkdownAssetEditor",
					"Children": [
						{
							"Source":
							{
								"Text": "Bold"
							},
							"Translation":
							{
								"Text": "太字"
							},
							"Key": "Bold"
						},
						{
							"Source":
							{
								"Text": "Bullet List"
							},
							"Translation":
							{
								"Text": "箇条書き"
							},
							"Key": "BulletList"
						},
						{
							"Source":
							{
								"Text": "Code Block"
							},
							"Translation":
							{
								"Text": "コードブロック"
							},
							"Key": "InsertCodeBlock"
						},
						{
							"Source":
							{
								"Text": "H1"
							},
							"Translation":
							{
								"Text": "H1"
							},
							"Key": "Heading1"
						},
						{
							"Source":
							{
								"Text": "H2"
							},
							"Translation":
							{
								"Text": "H2"
							},
							"Key": "Heading2"
						},
						{
							"Source":
							{
								"Text": "H3"
							},
							"Translation":
							{
								"Text": "H3"
							},
							"Key": "Heading3"
						},
						{
							"Source":
							{
								"Text": "Horizontal Rule"
							},
							"Translation":
							{
								"Text": "水平線"
							},
							"Key": "HorizontalRule"
						},
						{
							"Source":
							{
								"Text": "Insert a Markdown table"
							},
							"Translation":
							{
								"Text": "Markdownのテーブルを挿入"
							},
							"Key": "InsertTable_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert a blockquote"
							},
							"Translation":
							{
								"Text": "Insert a blockquote"
							},
							"Key": "Blockquote_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert a bullet list item"
							},
							"Translation":
							{
								"Text": "箇条書きリストの項目を挿入"
							},
							"Key": "BulletList_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert a fenced code block"
							},
							"Translation":
							{
								"Text": "フェンスで囲まれたコードブロックを挿入"
							},
							"Key": "InsertCodeBlock_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert a horizontal rule"
							},
							"Translation":
							{
								"Text": "水平線を挿入"
							},
							"Key": "HorizontalRule_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert a numbered list item"
							},
							"Translation":
							{
								"Text": "番号付きリストの項目を挿入"
							},
							"Key": "NumberedList_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert heading level 1"
							},
							"Translation":
							{
								"Text": "見出しレベル1を挿入"
							},
							"Key": "Heading1_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert heading level 2"
							},
							"Translation":
							{
								"Text": "見出しレベル2を挿入"
							},
							"Key": "Heading2_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Insert heading level 3"
							},
							"Translation":
							{
								"Text": "見出しレベル3を挿入"
							},
							"Key": "Heading3_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Italic"
							},
							"Translation":
							{
								"Text": "斜体"
							},
							"Key": "Italic"
						},
						{
							"Source":
							{
								"Text": "Numbered List"
							},
							"Translation":
							{
								"Text": "番号付きリスト"
							},
							"Key": "NumberedList"
						},
						{
							"Source":
							{
								"Text": "Quote"
							},
							"Translation":
							{
								"Text": "引用"
							},
							"Key": "Blockquote"
						},
						{
							"Source":
							{
								"Text": "Strikethrough"
							},
							"Translation":
							{
								"Text": "取り消し線"
							},
							"Key": "Strikethrough"
						},
						{
							"Source":
							{
								"Text": "Table"
							},
							"Translation":
							{
								"Text": "テーブル"
							},
							"Key": "InsertTable"
						},
						{
							"Source":
							{
								"Text": "Wrap selection with bold markers (**)"
							},
							"Translation":
							{
								"Text": "選択範囲を太字マーカー (**) で囲む"
							},
							"Key": "Bold_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Wrap selection with italic markers (*)"
							},
							"Translation":
							{
								"Text": "選択範囲を斜体マーカー (*) で囲む"
							},
							"Key": "Italic_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Wrap selection with strikethrough markers (~~)"
							},
							"Translation":
							{
								"Text": "選択範囲を取り消し線マーカー (~~) で囲む"
							},
							"Key": "Strikethrough_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "UMarkitdownBlueprintLibrary",
			"Children": [
				{
					"Source":
					{
						"Text": "Converting files via markitdown..."
					},
					"Translation":
					{
						"Text": "markitdown でファイルを変換しています..."
					},
					"Key": "BatchConverting"
				},
				{
					"Source":
					{
						"Text": "Converting {0}..."
					},
					"Translation":
					{
						"Text": "{0} を変換しています..."
					},
					"Key": "BatchConvertingItem"
				},
				{
					"Source":
					{
						"Text": "Markitdown: {0} / {1} asset(s) created in {2}"
					},
					"Translation":
					{
						"Text": "Markitdown: {2} に {0} / {1} 個のアセットを作成しました"
					},
					"Key": "BatchConvertComplete"
				},
				{
					"Source":
					{
						"Text": "Select files to convert via markitdown"
					},
					"Translation":
					{
						"Text": "markitdown で変換するファイルを選択"
					},
					"Key": "PickSourceFilesTitle"
				}
			]
		},
		{
			"Namespace": "UMarkitdownImportFactory",
			"Children": [
				{
					"Source":
					{
						"Text": "Converting {0} via markitdown..."
					},
					"Translation":
					{
						"Text": "markitdown で {0} を変換しています..."
					},
					"Key": "MarkitdownConverting"
				},
				{
					"Source":
					{
						"Text": "Failed to convert {0} via markitdown:\n\n{1}"
					},
					"Translation":
					{
						"Text": "markitdown による {0} の変換に失敗しました:\n\n{1}"
					},
					"Key": "MarkitdownImportFailed"
				},
				{
					"Source":
					{
						"Text": "Markitdown Import"
					},
					"Translation":
					{
						"Text": "Markitdown インポート"
					},
					"Key": "MarkitdownImportTitle"
				},
				{
					"Source":
					{
						"Text": "Re-converting {0} via markitdown..."
					},
					"Translation":
					{
						"Text": "markitdown で {0} を再変換しています..."
					},
					"Key": "MarkitdownReimporting"
				}
			]
		}
	]
}